Revit 2027 API
ScheduleDefinition.GetFieldOrder Method
 Gets the IDs of the current list of fields in order.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ScheduleFieldId> GetFieldOrder()
Public Function GetFieldOrder As IList(Of ScheduleFieldId)
public:
IList<ScheduleFieldId^>^ GetFieldOrder()
member GetFieldOrder : unit -> IList<ScheduleFieldId>
Return Value
IList<ScheduleFieldId>
 The IDs of the current list of fields.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace